Revit 2027 API
ExportLayerKey.CategoryName Property
 The category name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CategoryName { get; set; }
Public Property CategoryName As String
	Get
	Set
public:
property String^ CategoryName {
	String^ get ();
	void set (String^ value);
}
member CategoryName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportLayerKey Class
Autodesk.Revit.DB Namespace